       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBSHL01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.

       PROGRAM-DONE.
           STOP RUN.
          