      * Three levels of COBOL grammar: division, paragraph, sentence.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SENTENCES.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "This program contain four DIVISIONS,".
           DISPLAY "three PARAGRAPHS,".
           DISPLAY "and four SENTENCES.".
       PROGRAM-DONE.
           STOP RUN.
          