       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBSHL02.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  XXX               PIC X(20).
       01  YYY               PIC 9(03).
    
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

       PROGRAM-DONE.
           STOP RUN.
          