      * String and numeric constants.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONSTANT.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "Hello world".
           DISPLAY 55.
           DISPLAY 12.607.

       PROGRAM-DONE.
           STOP RUN.

        