      * Modifying a constant by editing and recompiling.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "I said, Hello world".

       PROGRAM-DONE.
           STOP RUN.

        