      * Adding another constant.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELOHELO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "Hello world".
           DISPLAY "I said, Hello world".

       PROGRAM-DONE.
           STOP RUN.

        